src/test/resources/benchmark_out/2024-08-05/container_4/out_pdf-fop-pool.log
starting benchmark...
spawning thread #0: 15 total client(s). 12500 total requests
spawning thread #1: 15 total client(s). 12500 total requests
spawning thread #2: 15 total client(s). 12500 total requests
spawning thread #3: 15 total client(s). 12500 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 41.97s, 1191.39 req/s, 19.95MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 837.19MB (877853320) total, 148.48KB (152040) headers (space savings 94.57%), 835.66MB (876249960) data
                     min         max         mean         sd        +/- sd
time for request:     2.18ms    252.68ms     49.59ms     39.64ms    54.02%
time for connect:     1.17ms      2.02ms      1.82ms       199us    85.00%
time to 1st byte:    11.96ms    189.48ms     62.78ms     47.08ms    75.00%
req/s           :      19.87       21.51       20.16        0.33    88.33%